use mermaid to replace plantuml, github only support mermaid diagrams
